# Posttest 2 Nupiq
2009106083

### Import Pandas Package

In [26]:
import pandas as pd

### Read Dataset

In [27]:
df = pd.read_csv("Movies.csv")

In [28]:
df

,id,title,overview,release_date,popularity,vote_average,vote_count
0,238,The Godfather,"Spanning the years 1945 to 1955, a chronicle o...",14-03-72,87.259,8.7,16607
1,278,The Shawshank Redemption,Framed in the 1940s for the double murder of h...,23-09-94,74.450,8.7,22327
2,240,The Godfather Part II,In the continuing saga of the Corleone crime f...,20-12-74,53.295,8.6,10043
3,19404,Dilwale Dulhania Le Jayenge,"Raj is a rich, carefree, happy-go-lucky second...",19-10-95,39.465,8.6,3875
4,424,Schindler's List,The true story of how businessman Oskar Schind...,15-12-93,51.786,8.6,13238
...,...,...,...,...,...,...,...
1996,362045,Bajirao Mastani,"Peshwa Bajirao married to Kashibai, falls in l...",18-12-15,9.539,7.3,227
1997,360606,Adventures in Babysitting,"Two teen rival babysitters, Jenny and Lola, te...",24-06-16,19.964,7.3,332
1998,65229,Tomboy,A French family moves to a new neighborhood wi...,20-04-11,11.369,7.3,564
1999,20312,Interstate 60,An aspiring painter meets various characters a...,13-04-02,11.570,7.3,511
2000,4543,The Meaning of Life,Life's questions are 'answered' in a series of...,31-03-83,17.498,7.3,1512

1. Informasi yang didapatkan adalah<br>1. Jumlah record<br>2. Nama atribut<br>3. Jumlah atribut dengan tipe objek<br>4. Jumlah atribut dengan tipe angka<br>5. Jumlah atribut yang memiliki nilai null.<br><br>Masukkan informasi di atas dalam dictionary dengan key<br>sesuai nama informasinya. Tampilkan isi dari dictionary<br>tersebut sebagus mungkin

In [29]:
jumlahRecord = len(df)
namaAtribut = df.columns
jumlahObjek = len(df.select_dtypes(include=['object']).columns)
jumlahAngka = len(df.select_dtypes(include=['int64', 'float64']).columns)
jumlahNULL = len(df.columns[df.isna().sum() > 0])

dictionary = {
    "1. Jumlah Record": jumlahRecord,
    "2. Nama Atribut": namaAtribut,
    "3. Jumlah Atribut dengan Tipe Objek": jumlahObjek,
    "4. Jumlah Atribut dengan Tipe Angka": jumlahAngka,
    "5. Jumlah Atribut dengan Nilai NULL": jumlahNULL,
}

pd.Series(dictionary)

1. Jumlah Record                                                                    2001
2. Nama Atribut                        Index(['id', 'title', 'overview', 'release_dat...
3. Jumlah Atribut dengan Tipe Objek                                                    3
4. Jumlah Atribut dengan Tipe Angka                                                    4
5. Jumlah Atribut dengan Nilai NULL                                                    0
dtype: object

2. Tampilkan rata-rata, standar deviasi, nilai minimum, nilai<br>maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

Tampilkan Nilai rata-rata

In [30]:
df.select_dtypes(include=['int64', 'float64']).mean()

id              165192.644178
popularity          48.507422
vote_average         7.692354
vote_count        2794.418291
dtype: float64

Tampilkan Nilai Standar deviasi

In [31]:
df.select_dtypes(include=['int64', 'float64']).std()

id              232417.457179
popularity         194.295225
vote_average         0.291095
vote_count        4416.430718
dtype: float64

Tampilkan Nilai Minimum

In [32]:
df.select_dtypes(include=['int64', 'float64']).min()

id               11.0
popularity        0.6
vote_average      7.3
vote_count      200.0
dtype: float64

Tampilkan Nilai Maksimum

In [33]:
df.select_dtypes(include=['int64', 'float64']).max()

id              985939.00
popularity        6059.21
vote_average         8.70
vote_count       32301.00
dtype: float64

Tampilkan Nilai Q1, Q2, dan Q3

In [34]:
df.select_dtypes(include=['int64', 'float64']).quantile([0.25,0.5,0.75])

            id  popularity  vote_average  vote_count
0.25    3063.0      10.909           7.5       396.0
0.50   19101.0      17.013           7.6       893.0
0.75  332270.0      35.259           7.9      2828.0

3. Tampilkan nilai korelasi attribute bertipe angka.

In [35]:
df.select_dtypes(include=['int64', 'float64']).corr()

                    id  popularity  vote_average  vote_count
id            1.000000    0.227929      0.079527   -0.089224
popularity    0.227929    1.000000      0.047942    0.117795
vote_average  0.079527    0.047942      1.000000    0.243134
vote_count   -0.089224    0.117795      0.243134    1.000000

4. Rubah nilai salah satu attribute bertipe angka dari desimal menjadi bilangan bulat).

Dataset types

In [36]:
df.dtypes

id                int64
title            object
overview         object
release_date     object
popularity      float64
vote_average    float64
vote_count        int64
dtype: object

In [37]:
df["vote_count"] = df["vote_count"].astype("float64")
df.dtypes

id                int64
title            object
overview         object
release_date     object
popularity      float64
vote_average    float64
vote_count      float64
dtype: object

5. Tampilkan 10 record pertama dari attribute bertipe angka.

In [38]:
df.select_dtypes(include=['int64', 'float64']).head(10)

       id  popularity  vote_average  vote_count
0     238      87.259           8.7     16607.0
1     278      74.450           8.7     22327.0
2     240      53.295           8.6     10043.0
3   19404      39.465           8.6      3875.0
4     424      51.786           8.6     13238.0
5  667257      11.519           8.5       269.0
6     129      98.981           8.5     13359.0
7  372058     140.708           8.5      9073.0
8     389      31.990           8.5      6673.0
9  496243      83.701           8.5     14416.0

6. Simpan dataset dengan attribute bertipe angka ke dalam file CSV.

In [39]:
df.select_dtypes(include=['int64', 'float64']).to_csv("Movies-angka.csv", index=False)